*Exercise 1.42:* Let f and g be two one-argument functions.  The "composition"
f after g is defined to be the function x |-> f(g(x)).  Define a
procedure `compose' that implements composition.  For example, if
`inc' is a procedure that adds 1 to its argument,

    ((compose square inc) 6)
    49

#+begin_src scheme :results list
  (define (compose a b)
    (lambda (x) (a (b x))))

  (list
   ((compose sqr add1) 6)
   ((compose sqr sqrt) 6))
#+end_src

#+RESULTS:
- 49
- 5.999999999999999
